"""Общие сообщения бота.

Предоставляет общие статические тексты сообщений бота.
Они могут быть использованы в любых обработчиках.
"""

# Появляется при первом запуске бота
START_MSG = (
    "😊 Привет, я помогу тебе узнать все про нужную тебе дораму/аниме.\n"
    "Название, описание, год, а самое главное - ссылку для просмотра!\n\n"
    "Чтобы посмотреть доступные команды, введи /help."
)

# При просмотре списка команд
HELP_MSG = (
    "Список моих возможностей: 👇\n"
    "- 💡 Случайный: выдаст тебе случайное аниме/дораму. Это весело!\n"
    "- 🔎 по названию: найдет дораму/аниме по введенному тобой названию.\n"
    "- 🎭 по жанру: выдаст список сериалов по конкретному жанру(ам).\n"
    "- 💎 по актеру: список дорам по конкретному актеру(ам).\n"
    "- 🎯 по году: список сериалов по введенному году (иди диапазону).\n"
    "- 📜 Мой список: все сериалы, которые вы добавили в Избранное.\n"
    "- 📝 в Избранное: Добавьте всё что пожелаете посмотреть по названию.\n"
    "- 🚫 Удалить из Избранного: удаляет сериал из Избранного.\n\n"
    "💡 Если укзаать несколько параметров - выдаст общий результат со всеми"
    "параметрами поиска."
)

